Tekla.Structures.Helper.AsyncFlag.SetAsyncInvoke(System.Boolean)
Flag to "manually" set if invoke calls should be awaited or run Async
async: true if not await required. False otherwise (e.g. for message Polling)